In [1]:
import pandas as pd

In [9]:
data = {"Names":["a","b","c","d","a","b","c","a"], "eng":[2,3,4,5,2,3,7,2], "math":[6,7,8,9,6,7,8,6]}

In [16]:
df = pd.DataFrame(data)
df

  Names  eng  math
0     a    2     6
1     b    3     7
2     c    4     8
3     d    5     9
4     a    2     6
5     b    3     7
6     c    7     8
7     a    2     6

In [17]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7     True
dtype: bool

In [18]:
# df["duplicated"] = df.duplicated()

In [19]:
# df

In [20]:
df.drop_duplicates()

  Names  eng  math
0     a    2     6
1     b    3     7
2     c    4     8
3     d    5     9
6     c    7     8

In [22]:
df.drop_duplicates(inplace=True)

In [23]:
df

  Names  eng  math
0     a    2     6
1     b    3     7
2     c    4     8
3     d    5     9
6     c    7     8

In [25]:
dataset = pd.read_csv("Hitters.csv")
dataset.head(3)

,Unnamed: 0,AtBat,Hits,HmRun,Runs,RBI,Walks,Years,CAtBat,CHits,...,CRuns,CRBI,CWalks,League,Division,PutOuts,Assists,Errors,Salary,NewLeague
0,-Andy Allanson,293,66,1,30,29,14,1,293,66,...,30,29,14,A,E,446,33,20,NaN,A
1,-Alan Ashby,315,81,7,24,38,39,14,3449,835,...,321,414,375,N,W,632,43,10,475.0,N
2,-Alvin Davis,479,130,18,66,72,76,3,1624,457,...,224,266,263,A,W,880,82,14,480.0,A

In [27]:
dataset.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
317    False
318    False
319    False
320    False
321    False
Length: 322, dtype: bool

In [28]:
dataset.duplicated().sum()

0

In [29]:
dataset.shape

(322, 21)

In [32]:
dataset.drop_duplicates(inplace=True)

In [33]:
dataset.shape

(322, 21)

In [34]:
dataset1 = pd.read_csv("diabetes_dataset.csv")
dataset1.head(3)

,PatientID,Age,Gender,BMI,BloodPressure,Insulin,Glucose,DiabetesPedigreeFunction,Outcome
0,1,52,0,30.239636,149,113,115,0.312886,1
1,2,53,1,30.932781,71,39,104,0.389526,0
2,3,21,0,45.092714,161,67,151,1.205869,0

In [35]:
dataset.duplicated().sum()

0